src/InformationRegisters/ВЧ_ОчередьУведомлений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ВЧ_ОчередьУведомлений</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Comment>Значение по умолчанию: "Ожидает"</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВЧ_СтатусыУведомлений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПопыткиОтправки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипСобытия</Name>
					<Comment>Значение по умолчанию: "НовыйСотрудник"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Параметры</Name>
					<Comment>Доп. данные (ФИО, телефон и т.д.)</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Comment>Когда задача поставлена в очередь</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоследнейПопытки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтветственныйКадровик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИДСообщения</Name>
					<Comment>Ключ уникальности (GUID)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>IDКанала</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ВЧ_СтатусыУведомлений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВЧ_СтатусыУведомлений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ожидает</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОбработке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CommonModules/ВЧ_ОбработчикиСобытий/Ext/Module.bsl
&НаСервере
Процедура Обработать() Экспорт
	
	// 1. Выбираем задачи, которые ждут обработки > 5 секунд (защита от транзакционных блокировок)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"|	ВЫБРАТЬ
		|		Очередь.Ссылка КАК ЗаписьОчереди,
		|		Очередь.Сотрудник,
		|		Очередь.Параметры
		|	ИЗ
		|		РегистрСведений.ВЧ_ОчередьУведомлений КАК Очередь
		|	ГДЕ
		|		Очередь.Статус = &СтатусОжидает
		|		И Очередь.ДатаСоздания < &ВремяОбработки";
	Запрос.УстановитьПараметр("СтатусОжидает", Перечисления.ВЧ_СтатусыУведомлений.Ожидает);
	Запрос.УстановитьПараметр("ВремяОбработки", ТекущаяДатаСеанса() - 5);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Попытка
			
			// 2. Получаем параметры задачи (ФИО кадровика)
			Параметры = Выборка.Параметры.Получить();
			ФИОКадровика = Параметры.ФИОКадровика;
			
			// 3. Получаем данные сотрудника
			Данные = ПолучитьДанныеСотрудника(Выборка.Сотрудник);
			Если Данные = Неопределено Тогда
				Продолжить; // Сотрудник мог быть удалён
			КонецЕсли;
			
			// 4. Формируем сообщение Markdown
			ТекстСообщения = СформироватьТекстУведомления(Данные, ФИОКадровика);
			
			// 5. Отправляем в VoceChat
			Результат = ВЧ_ИнтеграцияСервер.ОтправитьУведомление(Выборка.Сотрудник, ТекстСообщения);
			
			// 6. Обновляем статус в регистре
			ОбъектОчереди = Выборка.ЗаписьОчереди.ПолучитьОбъект();
			Если Результат.Успех Тогда
				ОбъектОчереди.Статус = Перечисления.ВЧ_СтатусыУведомлений.Отправлено;
				ЗаписьЖурналаРегистрации("ВЧ_Интеграция", , , Выборка.Сотрудник, "Уведомление успешно отправлено в VoceChat");
			Иначе
				ОбъектОчереди.Статус = Перечисления.ВЧ_СтатусыУведомлений.Ошибка;
				ЗаписьЖурналаРегистрации("ВЧ_Интеграция", УровеньЖурналаРегистрации.Ошибка, , Выборка.Сотрудник, Результат.ТекстОшибки);
			КонецЕсли;
			ОбъектОчереди.Записать();
			
		Исключение
			// Фиксируем критическую ошибку, чтобы задача не крутилась вечно
			ОбъектОчереди = Выборка.ЗаписьОчереди.ПолучитьОбъект();
			ОбъектОчереди.Статус = Перечисления.ВЧ_СтатусыУведомлений.Ошибка;
			ОбъектОчереди.Записать();
			ЗаписьЖурналаРегистрации("ВЧ_Интеграция", УровеньЖурналаРегистрации.Ошибка, , Выборка.Сотрудник, ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеСотрудника(Знач СсылкаНаСотрудника)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"|	ВЫБРАТЬ
		|		Сотрудники.ФизическоеЛицо.Наименование КАК ФИО,
		|		Сотрудники.Должность.Наименование КАК Должность,
		|		Сотрудники.Подразделение.Наименование КАК Подразделение,
		|		Сотрудники.ФизическоеЛицо.КонтактныйТелефон КАК Телефон
		|	ИЗ
		|		Справочник.Сотрудники КАК Сотрудники
		|	ГДЕ
		|		Сотрудники.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаСотрудника);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	Возврат Новый Структура("ФИО, Должность, Подразделение, Телефон",
		Выборка.ФИО,
		Выборка.Должность,
		Выборка.Подразделение,
		Выборка.Телефон
	);
	
КонецФункции

&НаСервере
Функция СформироватьТекстУведомления(Знач Данные, Знач ФИОКадровика)
	
	ТекстШаблона = 
		"| *Новая задача!*
		|═══════════════════════
		|Принят новый сотрудник.
		|
		| *ФИО:* %1
		| *Должность:* %2
		| *Подразделение:* %3
		| *Контакт с новым сотрудником (тел.):* %4
		|
		|═══════════════════════
		| *Задача:* Необходимо создать корпоративную электронную почту.
		|
		| *Ответственный кадровик:* %5
		|⏰ *Дата время:* %6
		|═══════════════════════
		|_Уведомление из 1С:ЗУП 3.1_";
	
	Возврат СтрШаблон(
		ТекстШаблона,
		Данные.ФИО,
		?(ПустаяСтрока(Данные.Должность), "Не указана", Данные.Должность),
		?(ПустаяСтрока(Данные.Подразделение), "Не указано", Данные.Подразделение),
		?(ПустаяСтрока(Данные.Телефон), "Не указан", Данные.Телефон),
		?(ПустаяСтрока(ФИОКадровика), "Не определён", ФИОКадровика),
		Формат(ТекущаяДатаСеанса(), "ДФ='dd.MM.yyyy HH:mm'")
	);
	
КонецФункции

&НаСервере
Процедура ВЧ_ПриЗаписиСотрудникаПриЗаписи(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт 
	
	// 1. Реагируем только на создание НОВОГО сотрудника
	Если Не Источник.ЭтоНовый() Тогда
		Возврат;
	КонецЕсли;
	
	// 2. Проверяем, включена ли интеграция вообще
	Если Не Константы.ВЧ_ИспользоватьИнтеграцию.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	// 3. Пытаемся определить, кто создал запись (Кадровик)
	ФИОКадровика = "Не определён";
	Попытка
		ТекущийПользователь = Пользователи.ТекущийПользователь();
		Если ТекущийПользователь <> Неопределено Тогда
			ФИОКадровика = ТекущийПользователь.Представление;
		КонецЕсли;
	Исключение
		// Если не удалось получить пользователя, оставляем заглушку
	КонецПопытки;
	
	// 4. Записываем задачу в очередь (быстро, <10мс)
	ЗаписьОчереди = РегистрыСведений.ВЧ_ОчередьУведомлений.СоздатьЗапись();
	ЗаписьОчереди.Сотрудник = Источник.Ссылка;
	ЗаписьОчереди.Статус = Перечисления.ВЧ_СтатусыУведомлений.Ожидает;
	ЗаписьОчереди.ДатаСоздания = ТекущаяДатаСеанса(); // Используем дату сеанса!
	
	// Сохраняем ФИО кадровика в параметры
	ЗаписьОчереди.Параметры = Новый ХранилищеЗначения(
		Новый Структура("ФИОКадровика", ФИОКадровика)
	);
	
	ЗаписьОчереди.Записать();
	
	// 5. Логируем для аудита
	ЗаписьЖурналаРегистрации("ВЧ_Интеграция", , , Источник.Ссылка, 
		"Задача на уведомление о новом сотруднике поставлена в очередь");
	
КонецПроцедуры
